CSI API ETABS v1
cSpandrelLabel Interface
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
public interface cSpandrelLabel
Public Interface cSpandrelLabel
Dim instance As cSpandrelLabel
public interface class cSpandrelLabel
type cSpandrelLabel =  interface end
The cSpandrelLabel type exposes the following members.
Methods
Name | Description
ChangeName
 Changes the name of a defined Spandrel Label
Delete
 Deletes the specified Spandrel Label
GetNameList
 Retrieves the names of all defined Spandrel Labels
GetSectionProperties
 Retrieves the section properties for a specified spandrel
GetSpandrel
 Retrieves the specified Spandrel Label
SetSpandrel
 Adds a new Spandrel Label, or modifies an existing Spandrel Label
Top
See Also
Reference
ETABSv1 Namespace